{
    "Items": [
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "1"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Tweening in Amazon Sumerian ist eine spezielle Animations-Art, die hauptsΣchlich von Spielen verwendet wird. Sie enthΣlt zusΣtzlich Sound Effekte."
            },
            "QuestionText-en": {
                "S": "Tweening in Amazon Sumerian is a special kind of animation mainly used by games, which includes sound effects."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "2"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "In Amazon Sumerian k÷nnen Nachrichten verwendet werden, um innerhalb einer Szene zu kommunizieren - zum Beispiel, um eine Animation von anderen Entities zu starten "
            },
            "QuestionText-en": {
                "S": "In Amazon Sumerian, Messages can be used to communicate within a scene - for example to start an animation for other entities."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "3"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Anchors werden von Augmented Reality-GerΣten in Echtzeit berechnet. Deshalb k÷nnen sie nicht zwischen mehreren GerΣten geteilt werden."
            },
            "QuestionText-en": {
                "S": "Anchors are calculated by the AR devices in real-time. Therefore, they can not be shared by multiple viewers."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "4"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Repeatability bedeutet, dass der selbe Ankerpunkt in unterschiedlichen unter verschiedenen Betrachtungsbedingungen gefunden werden kann."
            },
            "QuestionText-en": {
                "S": "Repeatability means that the same anchor point can be found even in different viewing conditions."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "5"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Eine einfΣrbige Wand ist ein guter Ort, um 3D Modelle zu verankern. Es hat eine glatte OberflΣche und kann deshalb leicht in unterschiedlichen Betrachtungsbedingungen gefunden werden."
            },
            "QuestionText-en": {
                "S": "A single-colored wall is a good place to anchor 3D models, as it has a smooth surface and is therefore easy to recognize in different viewing conditions."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "6"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Ein Anker verknⁿpft ein virtuelles 3D Objekt mit einem spezifischen Ort in der echten Welt."
            },
            "QuestionText-en": {
                "S": "An anchor links a virtual 3D object to a specific location in the real world."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "7"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Keypoints sollten unverΣnderlich in Bezug auf Rotation und Skalierung sein."
            },
            "QuestionText-en": {
                "S": "Keypoints should be invariant to rotation and scale."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "8"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Normalerweise speichern Algorithmen in einer Datenbank, wann und wo sie Keypoints gesehen haben. Dies wird dafⁿr genutzt, um Keypoints zuzuordnen und damit eine EinschΣtzung der 3D Position des Keypoints und der Kamera zu finden."
            },
            "QuestionText-en": {
                "S": "Usually, algorithms keep a database of when and where they observed keypoints. This is ultimately used to match them and create a 3D estimate of the keypoint & camera position."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "9"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Mit einer 3D Kamera ist es nicht mehr n÷tig, Keypoints zu finden um Ankerpunkte zu erstellen und 3D Objekte in der Augmented Reality-Welt zu platzieren."
            },
            "QuestionText-en": {
                "S": "With a 3D camera, finding keypoints is not necessary anymore to create anchors and place 3D objects in the AR world."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "10"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Das Finden von Keypoints muss ⁿblicherweise sehr schnell geschehen, da es in Augmented Reality-Szenarien in Echtzeit durchgefⁿhrt werden muss."
            },
            "QuestionText-en": {
                "S": "Keypoint detection usually needs to be very fast, as it has to be performed in real-time in AR scenarios."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "11"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Augmented Reality wird Virtual Reality zukⁿnftig in allen Bereichen ersetzen, da es technologisch fortgeschrittener ist."
            },
            "QuestionText-en": {
                "S": "Augmented Reality will replace Virtual Reality in all situations in the future, as it is technically superior."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "12"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Computer-generierte Sprachwiedergabe durch Services wie Amazon Polly ist oft eine gute Option, wenn Kosten und Zeitaufwand in Vergleich zu einem professionellen Sprecher berⁿcksichtigt werden. Die Sprache klingt nicht mehr allzu kⁿnstlich und es ist zusΣtzlich m÷glich, Hinweise zur korrekten Aussprache zu geben, falls der Computer andernfalls ein Wort falsch ausspricht."
            },
            "QuestionText-en": {
                "S": "Computer-generated speech through services like Amazon Polly is often a good option with regard to costs and time efforts compared to hiring a professional speaker. It doesn't sound very artificial anymore and it's also possible to provide pronunciation hints if the artificial voice doesn't pronounce correctly on its own."
            }
        },
        {
            "TrainingId": {
                "N": "2"
            },
            "QuestionId": {
                "N": "13"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Volumetrisches Rendern erlaubt eine sehr genaue und direkte ReprΣsentation von Bildern, die durch ein CT oder MR aufgenommen wurden. Jedes Pixel einer Zeile wird durch ein 3D Voxel reprΣsentiert. Ein gro▀er Nachteil sind die hohen Anforderungen an Speicher und Rechenleistung."
            },
            "QuestionText-en": {
                "S": "Volumetric rendering allows for a very accurate and direct representation of images acquired by CT or MRI. Each pixel from source slices is represented as a 3D voxel. A major downside is the high computing and memory requirement."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "1"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Ist Barrierefreiheit nur fⁿr Menschen mit Behinderungen wichtig?"
            },
            "QuestionText-en": {
                "S": "Is accessibility only important for people with disabilities?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "2"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "HTML5 wurde 2014 ver÷ffentlicht. Ist es noch immer die aktuelle Version?"
            },
            "QuestionText-en": {
                "S": "HTML5 was already released in 2014. Is it still the current version?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "2"
            },
            "QuestionText-de": {
                "S": "Welche Datei definiert die Struktur einer Webseite?"
            },
            "QuestionId": {
                "N": "3"
            },
            "QuestionType": {
                "N": "2"
            },
            "PossibleAnswers": {
                "S": "CSS|HTML|JavaScript"
            },
            "QuestionText-en": {
                "S": "Which file defines the structure of a web page?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "3"
            },
            "QuestionText-de": {
                "S": "Mit welcher CSS-Eigenschaft verΣnderst Du die Hintergrundfarbe?"
            },
            "QuestionId": {
                "N": "4"
            },
            "QuestionType": {
                "N": "2"
            },
            "PossibleAnswers": {
                "S": "color|bgcolor|background-color"
            },
            "QuestionText-en": {
                "S": "Which CSS property changes the background color?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "5"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Wird der Alternativ-Text von Bildern in Webseiten von Suchmaschinen verwendet? "
            },
            "QuestionText-en": {
                "S": "Do search engines use the alternate text of images in your web site?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Was ist das korrekte HTML Element fⁿr die gr÷▀te and wichtigste ▄berschrift?"
            },
            "QuestionId": {
                "N": "6"
            },
            "QuestionType": {
                "N": "2"
            },
            "PossibleAnswers": {
                "S": "h1|h6|heading"
            },
            "QuestionText-en": {
                "S": "Which is the correct HTML element for the largest and most important heading?"
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "7"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Cookies werden nur lokal auf dem Computer des Users gespeichert. Daher werden sie nicht zwischen Client und Server ausgetauscht."
            },
            "QuestionText-en": {
                "S": "Cookes are only stored locally on the user's computer. Therefore, they are not exchanged between client and server."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "8"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Wenn eine Webseite mit HTTP geladen wird, enthΣlt die Antwort des Servers einen Statuscode, z.B. 200 OK oder 404 Not Found."
            },
            "QuestionText-en": {
                "S": "When loading a website with HTTP, the response of the server contains a status code - e.g., 200 OK or 404 Not Found."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "9"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Wenn eine Webseite mit HTTP geladen wird, sendet der Client akzeptierte bzw. bevorzugte Sprachen an den Server."
            },
            "QuestionText-en": {
                "S": "When loading a website with HTTP, the client sends accepted or preferred languages to the server."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "10"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "HTML ist das Protokoll fⁿr die Daten-▄bertragung im Web."
            },
            "QuestionText-en": {
                "S": "HTML is a protocol for transmitting files in the web."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "11"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Im Browser kann der HTML-Text einer Webseite durch einen Rechtsklick und View Source angezeigt werden."
            },
            "QuestionText-en": {
                "S": "You can see the source code of any web site by right clicking and choosing view source."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "12"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "HTML5 ist eine Kombination aus Technologien und inkludiert beispielsweise Styling."
            },
            "QuestionText-en": {
                "S": "HTML5 is a combination of technologies and includes for example styling."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "QuestionId": {
                "N": "13"
            },
            "QuestionType": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "0"
            },
            "QuestionText-de": {
                "S": "Fⁿr das Editieren von HTML ist Visual Studio Code erforderlich."
            },
            "QuestionText-en": {
                "S": "For editing HTML code you need to use Visual Studio Code."
            }
        },
        {
            "TrainingId": {
                "N": "1"
            },
            "CorrectAnswer": {
                "N": "1"
            },
            "QuestionText-de": {
                "S": "Was sind die Bausteine einer HTML Seite?"
            },
            "QuestionId": {
                "N": "14"
            },
            "QuestionType": {
                "N": "2"
            },
            "PossibleAnswers": {
                "S": "Tag|Name|Label"
            },
            "QuestionText-en": {
                "S": "What are the building blocks of an HTML page?"
            }
        }
    ],
    "Count": 27,
    "ScannedCount": 27,
    "ConsumedCapacity": null
}
